# SetSlabStyle

## Description
Sets the Slab Style of a slab.

```pascal
PROCEDURE SetSlabStyle(
				slab      : HANDLE;
				slabStyle : LONGINT);
```

```python
def vs.SetSlabStyle(slab, slabStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slab|HANDLE|The slab.|
|slabStyle|LONGINT|The ref number of the Slab Style to apply to the slab. 0 for unstyled.|

## See Also
VS Functions:
GetSlabStyle

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural